tomrodinger/ESP32_STM32_programmer/src/main.cpp
#include <Arduino.h>

#include "firmware_fs.h"
#include "firmware_source.h"
#include "firmware_source_file.h"
#include "stm32g0_prog.h"
#include "swd_min.h"

#include <SPIFFS.h>

#include "product_info_injector_reader.h"
#include "program_state.h"
#include "serial_log.h"
#include "wifi_web_ui.h"

#include "first_block_override_reader.h"

#include "product_info.h"

static bool g_first_block_snapshot_valid = false;
static uint8_t g_first_block_snapshot[256];

static void set_first_block_snapshot(const uint8_t *b0, uint32_t n) {
  if (!b0 || n == 0) {
    g_first_block_snapshot_valid = false;
    return;
  }
  const uint32_t take = (n > sizeof(g_first_block_snapshot)) ? (uint32_t)sizeof(g_first_block_snapshot) : n;
  memcpy(g_first_block_snapshot, b0, take);
  if (take < sizeof(g_first_block_snapshot)) {
    memset(g_first_block_snapshot + take, 0xFF, sizeof(g_first_block_snapshot) - take);
  }
  g_first_block_snapshot_valid = true;
}

static const swd_min::Pins PINS(35, 36, 37);

// Production jig button:
// - GPIO45 configured as INPUT_PULLUP
// - external button pulls to GND when pressed
static constexpr int k_prod_button_pin = 45;
static constexpr uint32_t k_button_debounce_ms = 30;

// Forward declarations (used by production sequence helper).
static bool print_idcode_attempt();
static bool cmd_erase();
static bool cmd_write();
static bool cmd_verify();

static bool cmd_write_with_product_info(uint32_t serial, uint64_t unique_id);
static bool cmd_verify_with_product_info(uint32_t serial, uint64_t unique_id);

static void print_hex_dump_16(uint32_t base_addr, const uint8_t *data, uint32_t len);
static void print_product_info_struct(const product_info_struct &pi);
static bool cmd_sync_serial_from_log();
static bool cmd_print_log();

static void print_user_pressed_banner(char c) {
  if (c == ' ') {
    Serial.println("=== User pressed <space> (0x20) ========================");
    return;
  }
  // Print both the character (when printable) and the raw byte value for debugging.
  if (c >= 32 && c <= 126) {
    Serial.printf("=== User pressed '%c' (0x%02X) ========================\n", c, (unsigned char)c);
  } else {
    Serial.printf("=== User pressed 0x%02X ========================\n", (unsigned char)c);
  }
}

static void print_help() {
  Serial.println("Commands:");
  Serial.println("  h = help");
  Serial.println("  f = filesystem status (SPIFFS) + list files");
  Serial.println("  F = select firmware file (must match BL*; exactly one match required)");
  Serial.println("  i = reset + read DP IDCODE");
  Serial.println("  s = sync serial from log.txt (re-scan log, load next serial)");
  Serial.println("  S<serial> = set next serial (append USERSET_<serial>) (example: S1000)");
  Serial.println("  l = print /log.txt to Serial");
  Serial.println("  R = let firmware run: clear debug-halt state, pulse NRST, then release SWD pins");
  Serial.println("  t = SWD smoke test (DP power-up handshake + AHB-AP IDR)");
  Serial.println("  d = toggle SWD verbose diagnostics");
  Serial.println("  b = DP ABORT write test (write under NRST low, then under NRST high)");
  Serial.println("  c = DP CTRL/STAT single-write test (DP[0x04]=0x50000000)");
  Serial.println("  p = read Program Counter (PC) register (tests core register access)");
  Serial.println("  r = read first 8 bytes of target flash @ 0x08000000");
  Serial.println("  e = erase entire flash (mass erase; connect-under-reset recovery method)");
  Serial.println("  w = write firmware to flash (prints serial+unique_id, first block hexdump, product_info_struct)");
  Serial.println("      (prints a simple benchmark: connect/program/total time)");
  Serial.println("  v = verify firmware in flash (FAST; prints benchmark + mismatch count)");
  Serial.println("  a = all: connect+halt, erase, write, verify");
  Serial.println("  <space> = PRODUCTION: run i -> e -> w -> v -> R (fail-fast; stops at first error)");
  Serial.println("Production jig:");
  Serial.printf("  Button on GPIO%d (INPUT_PULLUP) pulls to GND when pressed -> runs <space> sequence\n",
                k_prod_button_pin);
}

static bool ensure_fs_mounted() {
  static bool mounted = false;
  if (mounted) return true;

  Serial.println("Mounting SPIFFS (partition label fwfs, base path /spiffs)...");
  mounted = firmware_fs::begin();
  Serial.println(mounted ? "SPIFFS mount OK" : "SPIFFS mount FAIL");
  return mounted;
}

static bool select_firmware_path(String &out_path) {
  if (!ensure_fs_mounted()) return false;
  const bool ok = firmware_fs::find_single_firmware_bin(out_path);
  if (ok) program_state::set_firmware_filename(out_path);
  return ok;
}

static void cmd_reset_pulse_run() {
  // A reliable way to "let the core run again" after it has been halted by SWD:
  // 1) Clear any debug-state that can keep the CPU halted (DHCSR.C_HALT)
  //    and disable vector-catch-on-reset (DEMCR.VC_CORERESET).
  // 2) Pulse NRST low, then release.
  //
  // Note: if the target firmware re-purposes SWD pins, a physically connected debugger
  // (or our own SWD line driving) can interfere electrically. We therefore avoid doing
  // any SWD activity after the reset pulse.

  Serial.println("Preparing target for normal run (clear C_HALT + clear VC_CORERESET)...");
  const bool prep_ok = stm32g0_prog::prepare_target_for_normal_run();
  Serial.println(prep_ok ? "Prep OK" : "Prep FAIL (continuing with NRST pulse)");

  Serial.println("Pulsing NRST LOW for 2ms, then releasing HIGH...");
  swd_min::set_nrst(true);
  delay(2);
  swd_min::set_nrst(false);

  // After reset, avoid continuing to drive SWD lines; target firmware may repurpose them.
  swd_min::release_swd_pins();
}

static bool cmd_reset_pulse_run_strict() {
  // Strict variant intended for production sequence:
  // if the SWD prep fails, treat it as a hard failure and do not proceed.
  Serial.println("Preparing target for normal run (clear C_HALT + clear VC_CORERESET)...");
  const bool prep_ok = stm32g0_prog::prepare_target_for_normal_run();
  if (!prep_ok) {
    Serial.println("ERROR: Prep for run failed; not pulsing NRST");
    return false;
  }

  Serial.println("Pulsing NRST LOW for 2ms, then releasing HIGH...");
  swd_min::set_nrst(true);
  delay(2);
  swd_min::set_nrst(false);

  // After reset, avoid continuing to drive SWD lines; target firmware may repurpose them.
  swd_min::release_swd_pins();
  return true;
}

static bool run_production_sequence(const char *source) {
  Serial.println("========================================");
  Serial.printf("PRODUCTION sequence triggered by %s\n", source);
  Serial.println("Sequence: i -> e -> w -> v -> R (fail-fast)");
  Serial.println("----------------------------------------");

  if (!serial_log::has_serial_next()) {
    Serial.println("ERROR: Production disabled: next serial not set (use WiFi UI to set it)");
    return false;
  }

  String fw_path;
  if (!select_firmware_path(fw_path)) {
    Serial.println("ERROR: Production disabled: no valid firmware file selected");
    return false;
  }

  // Track attempted steps for summary log.
  String attempted = "";
  serial_log::Consumed consumed;

  attempted += 'i';
  if (!print_idcode_attempt()) {
    Serial.println("ERROR: Production sequence aborted at step 'i' (IDCODE)");
    return false;
  }

  attempted += 'e';
  if (!cmd_erase()) {
    Serial.println("ERROR: Production sequence aborted at step 'e' (erase)");
    return false;
  }

  // Consume serial after erase succeeds (before write).
  consumed = serial_log::consume_after_erase();
  if (!consumed.valid) {
    Serial.println("ERROR: Serial consumption failed; aborting");
    return false;
  }

  Serial.printf("Production consumed serial=%lu unique_id=0x%08lX%08lX\n", (unsigned long)consumed.serial,
                (unsigned long)(consumed.unique_id >> 32), (unsigned long)(consumed.unique_id & 0xFFFFFFFFu));

