tomrodinger/ESP32_STM32_programmer/src/main.cpp
  attempted += 'w';
  if (!cmd_write_with_product_info(consumed.serial, consumed.unique_id)) {
    Serial.println("ERROR: Production sequence aborted at step 'w' (write)");
    (void)serial_log::append_summary(attempted.c_str(), consumed.serial, /*ok=*/false);
    return false;
  }

  attempted += 'v';
  if (!cmd_verify_with_product_info(consumed.serial, consumed.unique_id)) {
    Serial.println("ERROR: Production sequence aborted at step 'v' (verify)");
    (void)serial_log::append_summary(attempted.c_str(), consumed.serial, /*ok=*/false);
    return false;
  }

  attempted += 'R';
  if (!cmd_reset_pulse_run_strict()) {
    Serial.println("ERROR: Production sequence aborted at step 'R' (run)");
    (void)serial_log::append_summary(attempted.c_str(), consumed.serial, /*ok=*/false);
    return false;
  }

  (void)serial_log::append_summary(attempted.c_str(), consumed.serial, /*ok=*/true);
  Serial.println("PRODUCTION sequence SUCCESS");
  return true;
}

static bool print_idcode_attempt() {
  uint8_t ack = 0;
  uint32_t idcode = 0;

  // If verbose is enabled, the attach helper prints the attach banner lines.
  const bool ok = swd_min::attach_and_read_idcode(&idcode, &ack);

  Serial.printf("SWD ACK: %u (%s)\n", ack, swd_min::ack_to_str(ack));
  if (ok) {
    Serial.printf("DP IDCODE: 0x%08lX\n", (unsigned long)idcode);
  } else {
    Serial.println("DP IDCODE read failed.");
  }
  return ok;
}

static bool cmd_connect() {
  Serial.println("Connecting + halting core...");
  const bool ok = stm32g0_prog::connect_and_halt();
  Serial.println(ok ? "OK" : "FAIL");
  return ok;
}

static bool cmd_erase() {
  // Historical note: 'e' originally used a normal connect+halt flow. We now route
  // mass erase through the connect-under-reset recovery flow so it also works on
  // chips where user firmware disables SWD quickly.
  const bool ok = stm32g0_prog::flash_mass_erase_under_reset();
  Serial.println(ok ? "Erase OK" : "Erase FAIL");
  return ok;
}

static bool cmd_write() {
  String fw_path;
  if (!select_firmware_path(fw_path)) {
    Serial.println("Write FAIL (no valid firmware file selected)");
    return false;
  }

  // For manual 'w' testing, reserve a serial immediately and print it.
  // Production flow still consumes after 'e'.
  if (!serial_log::has_serial_next()) {
    Serial.println("Write FAIL (serial not set; use WiFi UI or 's' command)");
    return false;
  }
  const serial_log::Consumed reserved = serial_log::reserve_for_write();
  if (!reserved.valid) {
    Serial.println("Write FAIL (failed to reserve serial)");
    return false;
  }

  Serial.printf("Write will use serial=%lu unique_id=0x%08lX%08lX\n", (unsigned long)reserved.serial,
                (unsigned long)(reserved.unique_id >> 32), (unsigned long)(reserved.unique_id & 0xFFFFFFFFu));

  // Benchmark 'w' without changing SWD clock:
  // - keep existing verbose setting for connect reliability
  // - disable verbose only during programming (Serial prints dominate runtime)
  // - measure connect + program + total
  const bool prev_verbose = swd_min::verbose_enabled();

  firmware_source::FileReader file_reader(SPIFFS);
  if (!file_reader.open(fw_path.c_str())) {
    Serial.printf("Write FAIL (could not open firmware file: %s)\n", fw_path.c_str());
    return false;
  }
  firmware_source::ProductInfoInjectorReader injected(file_reader, reserved.serial, reserved.unique_id);
  firmware_source::Stm32G0Adapter fw_reader(injected);

  const uint32_t t0 = millis();
  const bool connect_ok = stm32g0_prog::connect_and_halt();
  const uint32_t t1 = millis();

  bool prog_ok = false;
  if (connect_ok) {
    swd_min::set_verbose(false);

    // Force first block load + patch, then print debug info.
    uint8_t tmp[1];
    uint32_t out_n = 0;
    (void)injected.read_at(0, tmp, 1, &out_n);
    const uint8_t *b0 = injected.first_block_ptr();
    if (b0) {
      set_first_block_snapshot(b0, firmware_source::ProductInfoInjectorReader::first_block_size());
      Serial.println("First 256 bytes to be programmed (after injection):");
      print_hex_dump_16(stm32g0_prog::FLASH_BASE, b0, firmware_source::ProductInfoInjectorReader::first_block_size());

      const uint32_t off = (uint32_t)(PRODUCT_INFO_MEMORY_LOCATION - stm32g0_prog::FLASH_BASE);
      product_info_struct pi;
      memcpy(&pi, b0 + off, sizeof(pi));
      print_product_info_struct(pi);
    }

    prog_ok = stm32g0_prog::flash_program_reader(stm32g0_prog::FLASH_BASE, fw_reader);
    swd_min::set_verbose(prev_verbose);
  }
  const uint32_t t2 = millis();

  const uint32_t ms_connect = t1 - t0;
  const uint32_t ms_program = t2 - t1;
  const uint32_t ms_total = t2 - t0;

  // Throughput estimate (payload bytes / programming time). Avoid div by zero.
  const float prog_s = (ms_program > 0) ? (ms_program / 1000.0f) : 0.0001f;
  const float kbps = (file_reader.size() / 1024.0f) / prog_s;

  Serial.printf("Benchmark w: connect=%lums program=%lums total=%lums (%.2f KiB/s over program phase)\n",
                (unsigned long)ms_connect, (unsigned long)ms_program, (unsigned long)ms_total, (double)kbps);

  const bool ok = connect_ok && prog_ok;
  Serial.println(ok ? "Write OK" : "Write FAIL");
  return ok;
}

static void print_hex_dump_16(uint32_t base_addr, const uint8_t *data, uint32_t len) {
  if (!data) return;
  for (uint32_t i = 0; i < len; i += 16) {
    Serial.printf("0x%08lX: ", (unsigned long)(base_addr + i));
    const uint32_t n = (len - i >= 16) ? 16 : (len - i);
    for (uint32_t j = 0; j < n; j++) {
      Serial.printf("%02X ", (unsigned)data[i + j]);
    }
    Serial.println();
  }
}

static void print_product_info_struct(const product_info_struct &pi) {
  Serial.println("product_info_struct:");
  char model[MODEL_CODE_LENGTH + 1];
  memcpy(model, pi.model_code, MODEL_CODE_LENGTH);
  model[MODEL_CODE_LENGTH] = 0;
  Serial.printf("  model_code: '%s'\n", model);
  Serial.printf("  firmware_compatibility_code: %u\n", (unsigned)pi.firmware_compatibility_code);
  Serial.printf("  hardware_version: %u.%u.%u\n", (unsigned)pi.hardware_version_major, (unsigned)pi.hardware_version_minor,
                (unsigned)pi.hardware_version_bugfix);
  Serial.printf("  serial_number: %lu\n", (unsigned long)pi.serial_number);
  Serial.printf("  unique_id: 0x%08lX%08lX\n", (unsigned long)(pi.unique_id >> 32),
                (unsigned long)(pi.unique_id & 0xFFFFFFFFu));
}

static bool cmd_write_with_product_info(uint32_t serial, uint64_t unique_id) {
  String fw_path;
  if (!select_firmware_path(fw_path)) {
    Serial.println("Write FAIL (no valid firmware file selected)");
    return false;
  }

  const bool prev_verbose = swd_min::verbose_enabled();

