tomrodinger/ESP32_STM32_programmer/src/main.cpp
  print_help();
  Serial.println();

  // Do one attempt automatically on boot.
  print_idcode_attempt();
}

static bool cmd_sync_serial_from_log() {
  if (!ensure_fs_mounted()) return false;
  const serial_log::SyncResult r = serial_log::sync_from_log();
  if (!r.ok) {
    Serial.println("Serial sync FAIL (could not read log)");
    return false;
  }
  Serial.printf("Serial log: %s\n", serial_log::log_path());
  if (!r.has_last) {
    Serial.println("Serial sync: no valid serial found (log empty or no newline-terminated lines)");
  } else {
    Serial.printf("Serial sync: last_serial=%lu (%s) -> next=%lu\n", (unsigned long)r.last_serial,
                  r.last_was_userset ? "USERSET" : "AUTO", (unsigned long)r.next_serial);
  }

  if (serial_log::has_serial_next()) {
    Serial.printf("Next serial (loaded): %lu\n", (unsigned long)serial_log::serial_next());
  } else {
    Serial.println("Next serial (loaded): NOT SET (use WiFi UI to set it)");
  }
  return true;
}

static bool cmd_print_log() {
  if (!ensure_fs_mounted()) return false;
  File f = SPIFFS.open(serial_log::log_path(), "r");
  if (!f) {
    Serial.println("Log open FAIL (missing?)");
    return false;
  }
  Serial.printf("--- %s ---\n", serial_log::log_path());
  while (f.available()) {
    const int c = f.read();
    if (c < 0) break;
    Serial.write((uint8_t)c);
  }
  Serial.println();
  Serial.println("--- END LOG ---");
  f.close();
  return true;
}

void loop() {
  // --- Production button handling (runs even if no Serial activity) ---
  static bool button_raw_last = true;     // pull-up => HIGH when released
  static bool button_stable = true;
  static uint32_t button_last_change_ms = 0;
  static bool button_armed = true;        // re-arm once released

  const bool raw = (digitalRead(k_prod_button_pin) != LOW);
  const uint32_t now_ms = millis();

  if (raw != button_raw_last) {
    button_raw_last = raw;
    button_last_change_ms = now_ms;
  }

  if ((uint32_t)(now_ms - button_last_change_ms) >= k_button_debounce_ms) {
    if (button_stable != raw) {
      button_stable = raw;

      // Falling edge (released->pressed): stable goes HIGH->LOW.
      if (!button_stable && button_armed) {
        button_armed = false;
        run_production_sequence("GPIO45 button");
      }

      // Re-arm after release.
      if (button_stable) {
        button_armed = true;
      }
    }
  }

  // --- Serial command handling ---
  if (!Serial.available()) {
    delay(10);
    return;
  }

  const char c = (char)Serial.read();

  // Ignore whitespace/newlines from terminal.
  // NOTE: Space is a real command (<space>) used for production programming.
  if (c == '\n' || c == '\r') {
    return;
  }

  print_user_pressed_banner(c);

  switch (c) {
    case 'f':
      if (ensure_fs_mounted()) firmware_fs::print_status();
      break;

    case 'F':
      {
        String fw_path;
        const bool ok = select_firmware_path(fw_path);
        Serial.println(ok ? "Firmware file selection OK" : "Firmware file selection FAIL");
      }
      break;

    case ' ':
      run_production_sequence("Serial <space>");
      break;

    case 'h':
    case '?':
      print_help();
      break;

    case 'i':
      print_idcode_attempt();
      break;

    case 's':
      cmd_sync_serial_from_log();
      break;

    case 'S':
      {
        // Parse decimal digits that follow 'S' on the same line, e.g. "S12345\n".
        // If no digits are present, do nothing (keeps it safe for accidental presses).
        String digits;
        const uint32_t start_ms = millis();
        while ((uint32_t)(millis() - start_ms) < 250) {
          if (!Serial.available()) {
            delay(1);
            continue;
          }
          const char d = (char)Serial.peek();
          if (d == '\n' || d == '\r') {
            (void)Serial.read();
            break;
          }
          if (d >= '0' && d <= '9') {
            digits += (char)Serial.read();
          } else {
            // Consume unexpected char and stop.
            (void)Serial.read();
            break;
          }
        }

        if (digits.length() == 0) {
          Serial.println("Set serial: no digits provided; use S<serial> (example: S1000)");
          break;
        }

        const uint32_t next = (uint32_t)digits.toInt();
        if (!ensure_fs_mounted()) {
          Serial.println("Set serial FAIL (FS not mounted)");
          break;
        }
        if (!serial_log::user_set_serial_next(next)) {
          Serial.println("Set serial FAIL (persist)");
          break;
        }
        Serial.printf("Set serial OK: USERSET_%lu\n", (unsigned long)next);
        (void)cmd_sync_serial_from_log();
      }
      break;

    case 'l':
      cmd_print_log();
      break;

    case 'R':
      cmd_reset_pulse_run();
      break;

    case 't':
      cmd_swd_smoke_test();
      break;

    case 'd':
      cmd_toggle_verbose();
      break;

    case 'b':
      cmd_dp_abort_write_test();
      break;

    case 'c':
      cmd_ap_csw_write_readback_test();
      break;

    case 'p':
      Serial.println("Reading Program Counter...");
      {
        const bool ok = stm32g0_prog::read_program_counter();
        Serial.println(ok ? "PC read: SUCCESS" : "PC read: FAILED");
      }
      break;

    case 'r':
      cmd_read_flash_first_8();
      break;

    case 'e':
      cmd_erase();
      break;

    case 'w':
      cmd_write();
      break;

    case 'v':
      cmd_verify();
      break;

    case 'a':
      Serial.println("Running full programming sequence...");
      {
        const bool ok = cmd_all();
        Serial.println(ok ? "SUCCESS" : "FAILED");
      }
      break;

    default:
      Serial.printf("Unknown command '%c' (0x%02X). Press 'h' for help.\n", c, (unsigned)c);
      break;
  }
}
